Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaElementTypeEnum
The area element types.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaElementTypeEnum.AREA_ELEMENT_TYPE_TRIANGULAR
The triangular area element type.

Tekla.Structures.Analysis.AnalysisPartAreaAttributes.AreaElementTypeEnum.AREA_ELEMENT_TYPE_QUADRILATERAL
The quadrilateral area element type.